Revit 2026 API

# RailSupportJustification Enumeration

---

The justification of the rail supports.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailSupportJustification
```
```vb
Public Enumeration RailSupportJustification
```
```cpp
public enum class RailSupportJustification
```
```fsharp
type RailSupportJustification
```

| Member name | Value | Description |
| --- | --- | --- |
| Begin | 0 | Supports are justified to the beginning of the rail. |
| Center | 1 | Supports are justified to the center of the rail. |
| End | 2 | Supports are justified to the end of the rail. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace